; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob43) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 pallet14 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 depot1)
	(clear crate13)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate10)
	(at pallet5 distributor2)
	(clear crate8)
	(at pallet6 distributor0)
	(clear crate12)
	(at pallet7 distributor0)
	(clear crate5)
	(at pallet8 distributor1)
	(clear crate11)
	(at pallet9 distributor0)
	(clear crate0)
	(at pallet10 distributor2)
	(clear pallet10)
	(at pallet11 depot0)
	(clear pallet11)
	(at pallet12 depot0)
	(clear crate6)
	(at pallet13 depot2)
	(clear crate2)
	(at pallet14 depot0)
	(clear pallet14)
	(at truck0 depot2)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot1)
	(available hoist6)
	(at crate0 distributor0)
	(on crate0 pallet9)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 depot2)
	(on crate2 pallet13)
	(at crate3 distributor2)
	(on crate3 pallet5)
	(at crate4 distributor0)
	(on crate4 pallet6)
	(at crate5 distributor0)
	(on crate5 pallet7)
	(at crate6 depot0)
	(on crate6 pallet12)
	(at crate7 distributor0)
	(on crate7 crate4)
	(at crate8 distributor2)
	(on crate8 crate3)
	(at crate9 distributor0)
	(on crate9 crate7)
	(at crate10 distributor1)
	(on crate10 pallet4)
	(at crate11 distributor1)
	(on crate11 pallet8)
	(at crate12 distributor0)
	(on crate12 crate9)
	(at crate13 depot1)
	(on crate13 pallet1)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 pallet13)
		(on crate2 pallet9)
		(on crate3 crate7)
		(on crate4 pallet11)
		(on crate5 pallet5)
		(on crate6 pallet12)
		(on crate7 pallet1)
		(on crate8 crate5)
		(on crate9 crate2)
		(on crate10 pallet8)
		(on crate11 pallet14)
		(on crate12 crate10)
		(on crate13 pallet4)
	)
))

; plan
1. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   goals met: 1 of 14
2. (lift hoist6 crate13 pallet1 depot1)
   deleted: (at crate13 depot1) (clear crate13) (available hoist6) (on crate13 pallet1)
   added: (lifting hoist6 crate13) (clear pallet1)
   goals met: 1 of 14
3. (lift hoist2 crate2 pallet13 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 pallet13)
   added: (lifting hoist2 crate2) (clear pallet13)
   goals met: 1 of 14
4. (load hoist2 crate2 truck0 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   goals met: 1 of 14
5. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 1 of 14
6. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 1 of 14
7. (load hoist6 crate13 truck1 depot1)
   deleted: (lifting hoist6 crate13)
   added: (in crate13 truck1) (available hoist6)
   goals met: 1 of 14
8. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 1 of 14
9. (lift hoist4 crate11 pallet8 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist4) (on crate11 pallet8)
   added: (lifting hoist4 crate11) (clear pallet8)
   goals met: 1 of 14
10. (load hoist4 crate11 truck1 distributor1)
   deleted: (lifting hoist4 crate11)
   added: (in crate11 truck1) (available hoist4)
   goals met: 1 of 14
11. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 1 of 14
12. (unload hoist0 crate11 truck1 depot0)
   deleted: (in crate11 truck1) (available hoist0)
   added: (lifting hoist0 crate11)
   goals met: 1 of 14
13. (drop hoist0 crate11 pallet14 depot0)
   deleted: (lifting hoist0 crate11) (clear pallet14)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 pallet14)
   goals met: 2 of 14
14. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 2 of 14
15. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 2 of 14
16. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 2 of 14
17. (unload hoist2 crate1 truck1 depot2)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   goals met: 2 of 14
18. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 2 of 14
19. (drop hoist2 crate1 pallet13 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet13)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 pallet13)
   goals met: 3 of 14
20. (lift hoist4 crate10 pallet4 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 pallet4)
   added: (lifting hoist4 crate10) (clear pallet4)
   goals met: 3 of 14
21. (drop hoist4 crate10 pallet8 distributor1)
   deleted: (lifting hoist4 crate10) (clear pallet8)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 pallet8)
   goals met: 4 of 14
22. (unload hoist4 crate13 truck1 distributor1)
   deleted: (in crate13 truck1) (available hoist4)
   added: (lifting hoist4 crate13)
   goals met: 4 of 14
23. (drop hoist4 crate13 pallet4 distributor1)
   deleted: (lifting hoist4 crate13) (clear pallet4)
   added: (available hoist4) (at crate13 distributor1) (clear crate13) (on crate13 pallet4)
   goals met: 5 of 14
24. (lift hoist5 crate8 crate3 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 crate3)
   added: (lifting hoist5 crate8) (clear crate3)
   goals met: 5 of 14
25. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 5 of 14
26. (load hoist5 crate8 truck0 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck0) (available hoist5)
   goals met: 5 of 14
27. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 5 of 14
28. (lift hoist5 crate3 pallet5 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist5) (on crate3 pallet5)
   added: (lifting hoist5 crate3) (clear pallet5)
   goals met: 5 of 14
29. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 5 of 14
30. (load hoist5 crate3 truck0 distributor2)
   deleted: (lifting hoist5 crate3)
   added: (in crate3 truck0) (available hoist5)
   goals met: 5 of 14
31. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 5 of 14
32. (lift hoist3 crate12 crate9 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist3) (on crate12 crate9)
   added: (lifting hoist3 crate12) (clear crate9)
   goals met: 5 of 14
33. (load hoist3 crate12 truck0 distributor0)
   deleted: (lifting hoist3 crate12)
   added: (in crate12 truck0) (available hoist3)
   goals met: 5 of 14
34. (lift hoist3 crate9 crate7 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 crate7)
   added: (lifting hoist3 crate9) (clear crate7)
   goals met: 5 of 14
35. (drop hoist3 crate9 crate0 distributor0)
   deleted: (lifting hoist3 crate9) (clear crate0)
   added: (available hoist3) (at crate9 distributor0) (clear crate9) (on crate9 crate0)
   goals met: 5 of 14
36. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 5 of 14
37. (unload hoist4 crate12 truck0 distributor1)
   deleted: (in crate12 truck0) (available hoist4)
   added: (lifting hoist4 crate12)
   goals met: 5 of 14
38. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 5 of 14
39. (drop hoist4 crate12 crate10 distributor1)
   deleted: (lifting hoist4 crate12) (clear crate10)
   added: (available hoist4) (at crate12 distributor1) (clear crate12) (on crate12 crate10)
   goals met: 6 of 14
40. (unload hoist3 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist3)
   added: (lifting hoist3 crate3)
   goals met: 6 of 14
41. (drop hoist3 crate3 crate7 distributor0)
   deleted: (lifting hoist3 crate3) (clear crate7)
   added: (available hoist3) (at crate3 distributor0) (clear crate3) (on crate3 crate7)
   goals met: 7 of 14
42. (lift hoist3 crate9 crate0 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 crate0)
   added: (lifting hoist3 crate9) (clear crate0)
   goals met: 7 of 14
43. (drop hoist3 crate9 crate3 distributor0)
   deleted: (lifting hoist3 crate9) (clear crate3)
   added: (available hoist3) (at crate9 distributor0) (clear crate9) (on crate9 crate3)
   goals met: 7 of 14
44. (lift hoist3 crate0 pallet9 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet9)
   added: (lifting hoist3 crate0) (clear pallet9)
   goals met: 7 of 14
45. (load hoist3 crate0 truck0 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck0) (available hoist3)
   goals met: 7 of 14
46. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 7 of 14
47. (unload hoist2 crate0 truck0 depot2)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   goals met: 7 of 14
48. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 7 of 14
49. (drop hoist2 crate0 pallet2 depot2)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (available hoist2) (at crate0 depot2) (clear crate0) (on crate0 pallet2)
   goals met: 8 of 14
50. (unload hoist3 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist3)
   added: (lifting hoist3 crate2)
   goals met: 8 of 14
51. (drop hoist3 crate2 pallet9 distributor0)
   deleted: (lifting hoist3 crate2) (clear pallet9)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 pallet9)
   goals met: 9 of 14
52. (lift hoist3 crate9 crate3 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 crate3)
   added: (lifting hoist3 crate9) (clear crate3)
   goals met: 9 of 14
53. (drop hoist3 crate9 crate2 distributor0)
   deleted: (lifting hoist3 crate9) (clear crate2)
   added: (available hoist3) (at crate9 distributor0) (clear crate9) (on crate9 crate2)
   goals met: 10 of 14
54. (lift hoist3 crate3 crate7 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist3) (on crate3 crate7)
   added: (lifting hoist3 crate3) (clear crate7)
   goals met: 9 of 14
55. (load hoist3 crate3 truck0 distributor0)
   deleted: (lifting hoist3 crate3)
   added: (in crate3 truck0) (available hoist3)
   goals met: 9 of 14
56. (unload hoist3 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist3)
   added: (lifting hoist3 crate8)
   goals met: 9 of 14
57. (drop hoist3 crate8 crate5 distributor0)
   deleted: (lifting hoist3 crate8) (clear crate5)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 crate5)
   goals met: 10 of 14
58. (lift hoist3 crate7 crate4 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist3) (on crate7 crate4)
   added: (lifting hoist3 crate7) (clear crate4)
   goals met: 10 of 14
59. (load hoist3 crate7 truck0 distributor0)
   deleted: (lifting hoist3 crate7)
   added: (in crate7 truck0) (available hoist3)
   goals met: 10 of 14
60. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 10 of 14
61. (unload hoist6 crate3 truck0 depot1)
   deleted: (in crate3 truck0) (available hoist6)
   added: (lifting hoist6 crate3)
   goals met: 10 of 14
62. (unload hoist1 crate7 truck0 depot1)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   goals met: 10 of 14
63. (drop hoist1 crate7 pallet1 depot1)
   deleted: (lifting hoist1 crate7) (clear pallet1)
   added: (available hoist1) (at crate7 depot1) (clear crate7) (on crate7 pallet1)
   goals met: 11 of 14
64. (drop hoist6 crate3 crate7 depot1)
   deleted: (lifting hoist6 crate3) (clear crate7)
   added: (available hoist6) (at crate3 depot1) (clear crate3) (on crate3 crate7)
   goals met: 12 of 14
65. (lift hoist3 crate4 pallet6 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 pallet6)
   added: (lifting hoist3 crate4) (clear pallet6)
   goals met: 12 of 14
66. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 12 of 14
67. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 12 of 14
68. (lift hoist3 crate8 crate5 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist3) (on crate8 crate5)
   added: (lifting hoist3 crate8) (clear crate5)
   goals met: 11 of 14
69. (load hoist3 crate8 truck0 distributor0)
   deleted: (lifting hoist3 crate8)
   added: (in crate8 truck0) (available hoist3)
   goals met: 11 of 14
70. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 11 of 14
71. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 11 of 14
72. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 11 of 14
73. (drop hoist0 crate4 pallet11 depot0)
   deleted: (lifting hoist0 crate4) (clear pallet11)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 pallet11)
   goals met: 12 of 14
74. (lift hoist3 crate5 pallet7 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 pallet7)
   added: (lifting hoist3 crate5) (clear pallet7)
   goals met: 12 of 14
75. (load hoist3 crate5 truck0 distributor0)
   deleted: (lifting hoist3 crate5)
   added: (in crate5 truck0) (available hoist3)
   goals met: 12 of 14
76. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 12 of 14
77. (unload hoist5 crate5 truck0 distributor2)
   deleted: (in crate5 truck0) (available hoist5)
   added: (lifting hoist5 crate5)
   goals met: 12 of 14
78. (drop hoist5 crate5 pallet5 distributor2)
   deleted: (lifting hoist5 crate5) (clear pallet5)
   added: (available hoist5) (at crate5 distributor2) (clear crate5) (on crate5 pallet5)
   goals met: 13 of 14
79. (unload hoist5 crate8 truck0 distributor2)
   deleted: (in crate8 truck0) (available hoist5)
   added: (lifting hoist5 crate8)
   goals met: 13 of 14
80. (drop hoist5 crate8 crate5 distributor2)
   deleted: (lifting hoist5 crate8) (clear crate5)
   added: (available hoist5) (at crate8 distributor2) (clear crate8) (on crate8 crate5)
   goals met: 14 of 14
